[
  {
    "slug": "web-development",
    "name": "Web 開発",
    "tagline": "フルスタックソリューション、設計から本番運用まで",
    "description": "約 30 年の Web 開発経験を活かし、アーキテクチャ設計からフロントエンド・バックエンド実装までフルスタックで対応します。React・Vue・Next.js などのモダンフロントエンドと、Node.js・Python・Java 等のバックエンド技術に精通しており、高性能でスケーラブルなエンタープライズ Web アプリケーションと API サービスを構築します。"
  },
  {
    "slug": "mobile-development",
    "name": "モバイル開発",
    "tagline": "ネイティブ & クロスプラットフォーム、体験重視",
    "description": "iOS / Android 向けのモバイルアプリ開発を提供します。ネイティブ開発（Swift, Kotlin）とクロスプラットフォーム（React Native, Flutter）双方に対応し、UX 設計からパフォーマンスチューニング、API 連携、プッシュ通知まで一貫してサポートします。"
  },
  {
    "slug": "desktop-development",
    "name": "デスクトップ開発",
    "tagline": "クロスプラットフォーム・デスクトップアプリ、高いパフォーマンス",
    "description": "Windows / macOS / Linux を対象としたデスクトップアプリケーション開発の豊富な経験があります。Electron・Qt・ネイティブ開発など多様な技術スタックに対応し、エンタープライズ用途にも耐える高性能・高ユーザビリティのデスクトップソフトウェアを実現します。"
  },
  {
    "slug": "embedded-development",
    "name": "組込み開発",
    "tagline": "ハードウェアとソフトウェアの融合、深いカスタマイズ",
    "description": "ハードウェアインターフェース設計から低レイヤソフトウェア開発までカバーする、組込みシステム開発サービスを提供します。IoT、スマートデバイス、産業オートメーション、エッジコンピューティングなどの分野で豊富な実績があり、リアルタイム性やリソース制約の厳しい環境にも対応可能です。"
  },
  {
    "slug": "ai-development",
    "name": "AI 開発",
    "tagline": "インテリジェントアプリケーション、データドリブン",
    "description": "実ビジネスの課題に対して、機械学習モデル、自然言語処理 (NLP)、コンピュータビジョン (CV)、レコメンデーションシステムなどの AI 技術を組み合わせたソリューションを提供します。TensorFlow や PyTorch など主要フレームワークに精通し、データ前処理からモデルトレーニング、推論環境へのデプロイまで一気通貫で対応します。"
  },
  {
    "slug": "cloud-development",
    "name": "クラウド開発",
    "tagline": "クラウドネイティブアーキテクチャとスケーラビリティ",
    "description": "クラウドプラットフォーム上でのアプリケーション開発を支援します。コンテナ化やマイクロサービス設計などのクラウドネイティブ開発、CI/CD や DevOps 自動化、クラウドセキュリティ、コスト最適化まで幅広く対応します。AWS・Azure・GCP といった主要クラウドに対応可能です。"
  },
  {
    "slug": "secondary-development",
    "name": "二次開発・レガシー刷新",
    "tagline": "既存システムのアップグレードと移行",
    "description": "レガシーシステムのモダナイゼーション、機能拡張、性能改善、アーキテクチャ再設計などを行います。業務を止めずに段階的にモダンな構成へ移行し、保守性と拡張性を高めながら技術的負債を削減します。"
  },
  {
    "slug": "consulting",
    "name": "技術コンサルティング",
    "tagline": "技術戦略立案とソリューション設計",
    "description": "約 30 年のプロジェクト経験をベースに、要件定義、技術選定、アーキテクチャ設計、プロジェクトマネジメント、コードレビュー、リスクコントロールなど包括的な技術コンサルティングを提供します。チームの技術ロードマップ策定や難易度の高い技術課題の解決、生産性とコード品質の向上を支援します。"
  }
]


